Repository: kauko-i/saastaruoassa
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: fi

source: The calculation is based on the following foods:
fi: Laskenta perustuu seuraaviin ruoka-aineisiin:

source: product
fi: tuote

source: The database is unreacable. The creator of this site will feel ashamed if they can't fix this within a couple of days.
fi: Tietokantaan ei saada yhteyttä. Tämän sivuston luoja tuntee häpeää, ellei saa tätä parissa päivässä korjattua.

source: Calculate your cheapest way to fulfill the nutritional recommendations!
fi: Laske, kuinka täytät ravitsemussuositukset halvimmalla!

source: The calculator is based on:
fi: Laskuri perustuu:

source: the nutritional values of 50 groceries
fi: 50 ruoka-aineen ravintoarvoihin

source: list of them
fi: lista niistä

source: their average prices in the Prisma stores in Finland
fi: niiden keskimääräisiin hintoihin Prismoissa

source: the official Finnish recommendations about the intake of vitamins, minerals, fibre, protein and fats
fi: valtion ravitsemusneuvottelukunnan suosituksiin vitamiinien, kivennäisaineiden, kuitujen, proteiinien ja rasvojen saannista

source: and
fi: ja

source: linear optimization
fi: lineaariseen optimointiin

source: Enter the required information:
fi: Syötä tarvittavat tiedot:

source: Age:
fi: Ikä:

source: Gender:
fi: Sukupuoli:

source: Male
fi: Mies

source: Female
fi: Nainen

source: Energy consumption (kcal/day):
fi: Energiantarve (kcal/päivä):

source: Celiac
fi: Keliakia

source: Lactose intolerant
fi: Laktoosi-intoleranssi

source: Vegetarian
fi: Kasvissyöjä

source: Vegan (if you check, the calculator will ignore iodine, vitamin B12, and docosahexaenoic acid)
fi: Vegaani (jos ruksaat, laskuri sivuuttaa jodin, B12-vitamiinin ja DHA-rasvahapon)

source: My needed protein intake is (g/day, the official recommendation will be used if you leave this empty):
fi: Proteiinin tarpeeni on (g/päivä, käytetään virallista suositusta, jos jätät tyhjäksi):

source: I know I get
fi: Tiedän saavani

source: µg of vitamin D from the sun per day.
fi: µg D-vitamiinia auringosta päivässä.

source: Calculate!
fi: Laske!

source: The results (weekly portion)
fi: Tulokset (viikottainen määrä)

source: Together
fi: Yhteensä

source: per week!
fi: / viikko!

source: WARNING:
fi: VAROITUS:

source: Certain processes destroy certain nutrients. For example, vitamin C gets easily destroyed when heated up, and its most essential source is
fi: Valmistustapa vaikuttaa ravintoarvoihin. Esimerkiksi C-vitamiini hajoaa helposti kuumennettaessa, ja sen tärkein lähde on

source: in these results. Furthermore, nothing proves the nutritional research to be ready. You follow the results at your own risk.
fi: tässä tuloksessa. Mikään ei myöskään todista, että ravitsemustutkimus olisi valmis. Laskurituloksen noudattaminen omalla vastuulla.

source: Back to the main page
fi: Palaa etusivulle

source: Save in Food
fi: Säästä ruoassa

source: Questions and feedback
fi: Kysymykset ja palaute
